## Plan Result (Dev)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 6 to destroy.</code></pre>

* Replace
  * module.casetracker.azurerm_role_assignment.dnszonecontributer
  * module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer
  * module.courtfines.azurerm_role_assignment.dnszonecontributer
  * module.dev.azurerm_role_assignment.dnszonecontributer
  * module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer
  * module.public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.casetracker.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/dev.casetracker.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/b585a5c4-c7d7-65c1-3fec-f6063344eadd" -> (known after apply)
      ~ name                             = "b585a5c4-c7d7-65c1-3fec-f6063344eadd" -> (known after apply)
      ~ principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b" -> "a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/dev.certificatedbailiffs.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/f1081d37-d8d6-0efd-1274-2db72e0a4233" -> (known after apply)
      ~ name                             = "f1081d37-d8d6-0efd-1274-2db72e0a4233" -> (known after apply)
      ~ principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b" -> "a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.courtfines.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/dev.courtfines.direct.gov.uk/providers/Microsoft.Authorization/roleAssignments/529fbac3-0d76-edff-e2fd-964caba6bf0a" -> (known after apply)
      ~ name                             = "529fbac3-0d76-edff-e2fd-964caba6bf0a" -> (known after apply)
      ~ principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b" -> "a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.dev.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/dev.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/5699c353-b84a-fe72-0345-95b76fc45d85" -> (known after apply)
      ~ name                             = "5699c353-b84a-fe72-0345-95b76fc45d85" -> (known after apply)
      ~ principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b" -> "a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/dev.immigrationappealsonline.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/02efc818-d25a-e4e6-2968-70f6abb63a46" -> (known after apply)
      ~ name                             = "02efc818-d25a-e4e6-2968-70f6abb63a46" -> (known after apply)
      ~ principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b" -> "a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/preview.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/7574ae16-45f4-d4af-f184-a13f46e3775b" -> (known after apply)
      ~ name                             = "7574ae16-45f4-d4af-f184-a13f46e3775b" -> (known after apply)
      ~ principal_id                     = "4fbd49ac-0f41-4712-b4ac-780af587f33b" -> "a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1351,"Program":"tfcmt","SHA1":"","Target":"Dev","Vars":{}} -->